// در Go متغیرها توسط کامپایر تعریف و استفاده می‌شوند.
// مثلا برای چک کردن نوع برگشتی یک تابع فراخوانده شده.

package main

import "fmt"

func main() {

    // بوسیله `var` می‌توان یک یا چند متغیر تعریف نمود.
    var a string = "initial"
    fmt.Println(a)

    // می‌توانید تعدادی متغیر را همزمان ایجاد کنید.
    var b, c int = 1, 2
    fmt.Println(b, c)

    // Go می‌تواند نوع مقدار اولیه متغیر را حدس زند.
    var d = true
    fmt.Println(d)

    // مقدار متغیرهای بدون مقدار اولیه
    // برابر مقدار صفر نوع خود هستند
    // مثلا مقدار یک `int` برابر `0` است.
    var e int
    fmt.Println(e)

    // عملگر `:=` ترکیب کوتاه شده تعریف و
    // مقداردهی متغیر است. برای مثال
    // `var f string = "short"` در اینجا.
    f := "short"
    fmt.Println(f)
}
